am/OpenFOAM-10/tutorials/multiphase/compressibleInterFoam/laminar/plateFilm/0/plateRegion/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/movingWallRegion";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    plateFaces_top
    {
        type            slip;
    }

    bottom
    {
        type            zeroGradient;
    }

    atmosphere
    {
        type            fixedValue;
        value           $internalField;
    }

    region0_to_plateRegion_plateFaces
    {
        type            noSlip;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
