am/OpenFOAM-10/tutorials/multiphase/compressibleInterFoam/laminar/plateFilm/system/plateRegion/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/plateRegion";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    div(phid,alpha) Gauss upwind;
    div(phi,U)      Gauss upwind;
    div(phi,e)      Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}


snGradSchemes
{
    default         uncorrected;
}


// ************************************************************************* //
